cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'

# stuff
brew 'coreutils'
brew 'git'
brew 'git-lfs'
brew 'hub'
brew 'openssl'
brew 'wget'
brew 'httpie'
brew 'tmux'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'fzf'
brew 'wifi-password'
brew 'cloc'
brew 'tldr'
brew 'cowsay'
brew 'lolcat'
brew 'neovim'
brew 'jq'

# programming languages
brew 'node'
brew 'yarn'
brew 'python'
brew 'python3'

# fish
brew 'fish'
brew 'fasd'
brew 'thefuck'

# fonts
cask 'font-input'
cask 'font-iosevka'

# cask apps
cask '1password'
cask 'alfred'
cask 'java'
cask 'google-chrome'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'atom'
cask 'transmission'
cask 'vlc'
cask 'iterm2'
cask 'couleurs'
cask 'flux'
cask 'visual-studio-code'
cask 'insomnia'
cask 'dash'
cask 'fantastical'
cask 'sonos'
